
# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 2.5  # changed from 1.0 to 2.5

# Anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, BottleneckCSP, [1024]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
  ]

# YOLOv5 head
head:
  [[-1, 3, BottleneckCSP, [512]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [1024]],
   [[-2, -1], 1, Concat, [1, 1e-3]],  # cat head P3
   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 18], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [1024]],
   [[-2, -1], 1, Concat, [1, 1e-3]],  # cat head P3
   [-1, 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
